Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public virtual void Append(
	IntersectionResult item
)
  Visual Basic
Public Overridable Sub Append ( _
	item As IntersectionResult _
)
  Visual C++
public:
virtual void Append(
	IntersectionResult^ item
)
 Parameters
  item
 Type:  Autodesk.Revit.DB IntersectionResult
 See Also
  IntersectionResultArray Class
  Autodesk.Revit.DB Namespace